=begin JA
= 謝辞
=end JA
=begin EN
= Acknowledgement
=end EN
=begin

# * 2007/12/05 (佐々木洋平) Makefile.rd2html の更新に合わせた修正
# * 2005/07/21 (小高正嗣) 最終更新 
# * 2005/06/30 (小高正嗣) 最終更新 
# * 2005/04/01 (小高正嗣) 最終更新 
# * 2005/04/01 (小高正嗣)
# * 2005/03/30 (小高正嗣)
# * 2004/03/18 (小高正嗣)
# * 2004/01/26 (小高正嗣)
# * 2002/09/12 (竹広真一, 林祥介)
# * 2002/02/15 (竹広真一) 新規作成

=end

=begin JA

SPMODEL プロジェクト資源の開発・整備に際して受けた援助を以下に記す. 

* 平成 14-16 年度 国立天文台 共同研究
  「天体内部運動の理解のための基礎的流体数値実験の研究」

* 平成 14-16 年度 国立天文台データ解析計算センター
  大規模シミュレーションプロジェクト(カテゴリーC)
  「天体内流体現象の理解のための流体数値モデルの開発と数値実験」

* 平成 15-16 年度 日本学術振興会 科学研究費補助金 基盤研究一般(C)
  「スペクトルモデルを用いた地球惑星流体仮想数値実験室の開発」

* 平成 10-14 年度 高度情報科学技術研究機構(RIST) 技術振興調整費
  「高精度の地球変動予測のための並列ソフトウェア開発に関する研究」

=end
=begin EN

Sorry, under construction.
=end



