# GPhys, GGraph チュートリアル
#
# = 履歴 (新しいものは上から追記)
#
# * 2012/02/28 堀之内武  新たに index.rd として作成開始
# * 2012/02/18 納多哲史  ページ分割, 構成案として kousei.rd に改名
# * 2012/02/16 納多哲史  index.rd として作成

= GPhys, GGraphチュートリアル

((* (2012-02-28) このドキュメントは現在作成中です. 
これまでのチュートリアルは ((<こちら|URL:http://ruby.gfd-dennou.org/products/gphys/tutorial/>)) です．*))

著者：堀之内武，納多哲史

GPhys, GGraph の機能を短時間で体験するためのチュートリアルです.
各機能の詳しい説明や, より詳しい便利な使い方については
各ページ内で紹介されている
ドキュメントを参考にしてください.

==== 1. ((<はじめる前に|URL:./getting_started.htm>))

本チュートリアルを始める前の準備です．

==== 2. ((<可視化の第一歩|URL:./ggraph_hop.htm>))

Rubyの対話シェルを使って，気象データの絵が簡単に描けることを体験します．

==== 3. ((<可視化の第二歩|URL:./ggraph_step.htm>))



==== Ruby, NArray の体験

==== GPhys を使ってちょっと応用
