# GPhys, GGraph チュートリアル
#
# = 履歴 (新しいものは上から追記)
#
# * 2012/02/28 堀之内武  新たに index.rd として作成開始
# * 2012/02/18 納多哲史  ページ分割, 構成案として kousei.rd に改名
# * 2012/02/16 納多哲史  index.rd として作成

= GPhys, GGraphチュートリアル

((* (2012-02-28) このドキュメントは現在作成中です. 
これまでのチュートリアルは ((<こちら|URL:http://ruby.gfd-dennou.org/products/gphys/tutorial/>)) です．*))

著者：堀之内武，納多哲史

GPhys, GGraph の機能を短時間で体験するためのチュートリアルです.
Ruby を知らない人も対象です．
「コピペ」で，いろんなお絵描きや数学統計操作をやってみましょう．
習うより慣れろで，この文章だけで大気のデータ解析がある程度出来るようになるでしょう．

各機能の詳しい説明や より詳しい便利な使い方については,
各ページ内で紹介されているドキュメントを参考にしてください.
さらに自在に使いこなすためには，このあと Ruby の勉強もしましょう
（Ruby は楽しいですよ）．

* GPhys のバージョン：この文章の作成には GPhys 1.2 を用いました．それ以降のバージョンの利用を勧めます．

==== 1. ((<はじめる前に|URL:./getting_started.htm>))

本チュートリアルを始める前の準備です．

==== 2. ((<可視化の第一歩|URL:./ggraph_hop.htm>))

Rubyの対話的インタープリター irb を使って，気象データの絵が簡単に描けることを体験します．

==== 3. ((<可視化の第二歩|URL:./ggraph_step.htm>))

引き続き irb を使ってお絵描きします．
いろんな断面やズームアップ，簡単な操作（平均，引き算等）を体験します．
描画のオプションも紹介しますが，まだ見てくれの細部にはこだわらず，所望の絵を素早く描くことを重視します．

==== Ruby, NArray の体験

==== GPhys を使ってちょっと応用
